Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 20, 20, 3)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 20, 20, 32)        896       
_________________________________________________________________
batch_normalization_7 (Batch (None, 20, 20, 32)        128       
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 20, 20, 32)        0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 20, 20, 32)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 20, 20, 64)        18496     
_________________________________________________________________
batch_normalization_8 (Batch (None, 20, 20, 64)        256       
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 20, 20, 64)        0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 20, 20, 64)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 20, 20, 128)       73856     
_________________________________________________________________
batch_normalization_9 (Batch (None, 20, 20, 128)       512       
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 20, 20, 128)       0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 20, 20, 128)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 20, 20, 128)       147584    
_________________________________________________________________
batch_normalization_10 (Batc (None, 20, 20, 128)       512       
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 20, 20, 128)       0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 20, 20, 128)       0         
_________________________________________________________________
global_average_pooling2d_2 ( (None, 128)               0         
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 200)               25800     
_________________________________________________________________
batch_normalization_11 (Batc (None, 200)               800       
_________________________________________________________________
leaky_re_lu_13 (LeakyReLU)   (None, 200)               0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 200)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 100)               20100     
_________________________________________________________________
batch_normalization_12 (Batc (None, 100)               400       
_________________________________________________________________
leaky_re_lu_14 (LeakyReLU)   (None, 100)               0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 100)               0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 10)                1010      
=================================================================
Total params: 290,350
Trainable params: 289,046
Non-trainable params: 1,304
_________________________________________________________________
